Конфигурация отчетов/DataProcessors/ОтчетПоПиццерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОтчетПоПиццерии</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбщиеСведенья</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Терминал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Закупка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прибыль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Зарплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мангал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сушист</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковщик</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заготовщик</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уборка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пицеола</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗакупкиЗакупщика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолжность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолжность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Enums/Заведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Заведение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паустовского</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таирово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филатово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дерибасовская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Люстдорф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПицерияЗаболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кондитерка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черноморск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/СтандартныеСтатьи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтандартныеСтатьи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщаяКасса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаКухня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаБар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Десерты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хлеб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дизель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтиркаПаустовского</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Анжела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стирка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставленоНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОставленоЗакупщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассаОфициантов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ОтчетПоПиццерии/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ЗаполнениеИнформацииПоЗП()
	Объект.Зарплаты.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			ИнфоЗП = Объект.Зарплаты.Добавить();
			ИнфоЗП.Дата = Отчет.ДатаСмены;
			Для Каждого Выборка Из Отчет.Зарплаты Цикл
				Если Выборка.Сотрудник.Наименование = "Мангал" Тогда
					ИнфоЗП.Мангал = Выборка.Сумма;				
				ИначеЕсли Выборка.Сотрудник.Наименование = "Сушист" Тогда
					ИнфоЗП.Сушист = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Упаковщик" Тогда
					ИнфоЗП.Упаковщик = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Заготовщик" Тогда
					ИнфоЗП.Заготовщик = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Уборка" Тогда
					ИнфоЗП.Уборка = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Пиццеола" Тогда
					ИнфоЗП.Пицеола = Выборка.Сумма;
				ИначеЕсли Выборка.Сотрудник.Наименование = "Продавец" Тогда
					ИнфоЗП.Продавец = Выборка.Сумма;
				КонецЕсли;
			КонецЦикла;
	
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция ЗаполнениеИнформацииПоЗакупщику()
	Объект.ЗакупкиЗакупщика.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			
			Для Каждого Выборка Из Отчет.ЗадолжнотиЗакупщика Цикл
				Если Выборка.ТекущаяЗакупка = Истина Тогда 
					ИнфоЗакуп = Объект.ЗакупкиЗакупщика.Добавить();
					ИнфоЗакуп.Дата = Отчет.ДатаСмены;
					ИнфоЗакуп.СуммаЗакупки = Выборка.СуммаТекущейЗакупки;
					ИнфоЗакуп.Оплачено = Выборка.Сумма; 
					ИнфоЗакуп.Задолжность = Выборка.Неоплачено; 
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнениеОбщихСведений()
	Объект.ОбщиеСведенья.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			ОбщИнф = Объект.ОбщиеСведенья.Добавить();
			ОбщИнф.Дата = Отчет.ДатаСмены;
			//касса
			Для Каждого Выборка Из Отчет.ОсновнаяИнформация Цикл
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.ОбщаяКасса Тогда
					ОбщИнф.Касса = Выборка.Сумма;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			//терминал
			Для Каждого Выборка Из Отчет.Расходы Цикл
				Если Выборка.Статья.СтандартнаяСтатья = Перечисления.СтандартныеСтатьи.Терминал Тогда
					ОбщИнф.Терминал = Выборка.Сумма;	
				КонецЕсли;
			КонецЦикла;
			//расходы (зп,закупки)
			СуммаЗП = Отчет.Зарплаты.Итог("Сумма");
			СуммаЗакупки = Отчет.Накладные.Итог("Сумма");
			ОбщИнф.Расходы = СуммаЗП + СуммаЗакупки;
			//остаток
			Остаток = ОбщИнф.Касса - ОбщИнф.Терминал - ОбщИнф.Расходы;
			ОбщИнф.Остаток = Остаток;
			ОбщИнф.ЗП = СуммаЗП;
			ОбщИнф.Закупка = СуммаЗакупки;
			ОбщИнф.Прибыль = ОбщИнф.Касса - ОбщИнф.Расходы;

		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ЗаполнениеИнформацииПоПоставщикам()
	Объект.Поставщики.Очистить();
	Отчет = Документы.ДневнойОтчет.Выбрать(Объект.ДатаНач,Объект.ДатаКон);
	Пока Отчет.Следующий() Цикл
		Если Отчет.Заведение = Перечисления.Заведение.ПицерияЗаболотного Тогда
			
			Для Каждого Выборка Из Отчет.Накладные Цикл
				Если Выборка.Сумма > 0 Тогда
					Если Выборка.Закупщик = Ложь Тогда
						Если Выборка.Оплачено = Ложь Тогда
							Накладная = Объект.Поставщики.Добавить();
							Накладная.Дата = Отчет.ДатаСмены;
							Накладная.Поставщик = Выборка.Поставщик; 
							Накладная.Сумма = Выборка.Сумма;
							Если Выборка.Оплачено = Истина Тогда
								Накладная.Оплачено = Выборка.Сумма; 
							Иначе
								Накладная.Задолжность = Выборка.Сумма; 
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				 КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции


&НаСервере
Процедура СформироватьНаСервере()
	//заполнение зарплат
	ЗаполнениеИнформацииПоЗП();
	//заполнение закупщика
	ЗаполнениеИнформацииПоЗакупщику();	
	//заполнение накладных
	ЗаполнениеИнформацииПоПоставщикам();		
	//заполнение общих сведений
	ЗаполнениеОбщихСведений();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
